import { Footer } from '../components/Footer';
import { NavBar } from '../components/Navbar';

export function AgreementPage() {
    return (
        <>
            <NavBar />
            <div style={{ padding: '70px 30px' }}>
                <h1>Terms of Use</h1>
                欢迎使用我们的app（以下简称“我们的app”或“我们”）。我们的app由Toolkitx&BingooKids开发和运营。在使用我们的app之前，请您仔细阅读并同意本Terms
                of
                Use（以下简称“本协议”）。如果您不同意本协议的任何条款，您应该立即停止使用我们的app。如果您继续使用我们的app，即表示您已经接受并遵守本协议。
                <br />
                <br />
                1. 使用我们的app
                <br />
                <br />
                您可以直接使用我们的app的全部或部分功能和服务，无需注册或创建一个账户。
                <br />
                您使用我们的app时，应当遵守法律法规、社会公德和本协议的规定，不得利用我们的app从事任何违法或不正当的活动。如果您违反了上述要求，我们有权暂停或终止向您提供我们的app的全部或部分功能和服务。
                <br />
                您使用我们的app时，应当尊重我们和其他用户的知识产权和合法权益，不得侵犯、损害或滥用我们和其他用户在我们的app上发布或使用的内容。如果您违反了上述要求，我们有权暂停或终止向您提供我们的app的全部或部分功能和服务，并要求您承担相应的责任。
                <br />
                您使用我们的app时，应当自行判断风险，并自行承担后果。我们不对我们的app上发布或展示的任何内容（包括但不限于广告、推荐、链接等）作任何形式的保证或担保。
                <br />
                <br />
                2. 购买会员（适用于支持会员的APP） <br />
                <br />
                您可以通过苹果App
                <br />
                Store的内购功能一次性购买永久会员，享受更多的功能和服务。
                <br />
                您购买会员时，应当遵守苹果App
                Store的相关规则和条款，并自行承担支付费用。
                <br />
                您购买会员后，无法取消或退款，除非苹果App
                Store允许或要求这样做。
                <br />
                您购买会员后，应当合理使用会员功能和服务，不得滥用、转让、出租、出借或分享给他人。如果您违反了上述要求，我们有权暂停或终止向您提供会员功能和服务，并要求您承担相应的责任。
                <br />
                <br />
                3. 知识产权
                <br />
                <br />
                我们拥有并保留我们的app及其相关内容（包括但不限于软件、代码、图标、界面、文案、图片、视频、音频等）的一切知识产权，包括但不限于著作权、商标权、专利权等。
                我们授予您一个非独占性、非转让性、可撤销性的许可，允许您在遵守本协议的前提下下载、安装和使用我们的app及其相关内容。
                <br />
                <br />
                4. 免责声明
                <br />
                <br />
                我们在提供我们的app的服务时，会尽力保证服务的稳定性、安全性、可靠性和及时性，但是由于互联网技术的复杂性和不确定性，我们无法保证我们的app的服务不会出现任何中断、延迟、错误、遗漏或病毒等问题。因此，我们在法律允许的范围内，对以下情形不承担任何责任：
                <br />
                由于不可抗力或者其他无法控制的原因，导致我们的app的服务中断、延迟、错误、遗漏或病毒等问题；
                <br />
                由于您的设备、网络、软件或其他原因，导致您无法正常使用我们的app的服务或者使用我们的app的服务时遭受损失或损害；
                <br />
                由于您使用我们的app的服务时，侵犯了第三方的知识产权或者其他合法权益，导致您被第三方起诉或索赔；
                <br />
                由于您使用我们的app的服务时，违反了本协议或者相关法律法规，导致您被有关部门处罚或追究责任；
                <br />
                由于您使用我们的app的服务时，信赖了我们的app上发布或展示的内容，导致您做出错误的判断或决策；
                <br />
                由于您使用我们的app的服务时，与其他用户或第三方发生纠纷或争执，导致您遭受损失或损害；
                <br />
                除非我们与您另有明确约定，否则我们对我们的app上发布或展示的任何内容（包括但不限于广告、推荐、链接等）不作任何形式的保证或担保。
                <br />
                请您在使用我们的app的服务时，自行判断风险，并自行承担后果。我们仅在法律要求的范围内对我们的app的服务承担责任。
                <br />
                <br />
                5. 争议解决
                <br />
                <br />
                如果您与我们或者其他用户或第三方在使用我们的app的过程中发生任何争议或纠纷，您应当首先尝试通过友好协商的方式解决。如果协商不成，您同意将争议或纠纷提交给开发者所在地的仲裁机构进行仲裁，仲裁结果为终局，对双方均有法律约束力。
                如果您与我们或者其他用户或第三方在使用我们的app的过程中发生任何争议或纠纷，您同意以本开发者所在地为管辖地，适用以本开发者所在地的法律，并向以本开发者所在地的法院提起诉讼。
                <br />
                <br />
                6. 联系方式
                <br />
                <br />
                如果您对本协议或者我们的app有任何疑问、意见或建议，您可以通过以下方式与我们联系：
                <br />
                <br />
                邮箱：alex.huang@toolkitx.net
                <br />
                <br />
                我们会尽快回复您的咨询，并尽力解决您的问题。我们感谢您对我们的app的支持和信任。
            </div>
            <Footer></Footer>
        </>
    );
}
